Домашние инвестиции/src/Catalogs/Активы/Активы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Активы</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктива</name>
    <type>
      <types>CatalogRef.ВидыАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Датапогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекторЭкономики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Торгуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Домашние инвестиции/src/Catalogs/Активы/Forms/ФормаСписка/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьСправочник(Команда)
	
	ПараметрыОткрытия = новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина);
	//@skip-check notify-description-to-server-procedure
	ПослеВыбора = новый ОписаниеОповещения("ПослеВыбораВидаАктива", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыАктивов.ФормаВыбора",ПараметрыОткрытия,,,,,ПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПослеВыбораВидаАктива(МассивВидовАктивов, ДополнительныеПараметры) Экспорт 

	Если МассивВидовАктивов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если МассивВидовАктивов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьАктивыНаСервере(МассивВидовАктивов);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАктивыНаСервере(МассивВидовАктивов)
	
	МодульРаботыСВалютами = ПодключаемыеМодулиСервер.МодульРаботыСАктивами();
	МассивАктивов = МодульРаботыСВалютами.СписокАктивовПоВыбраннымВидам(МассивВидовАктивов);
	
	Для каждого СтрокаАктива Из МассивАктивов Цикл
		
		Сообщить(СтрШаблон("Наименование %1, ISIN %2, Дата погашения %3, Торгуется %4, Сектор экономики %5, Тикер %6", СтрокаАктива.Наименование, СтрокаАктива.ISIN, СтрокаАктива.ДатаПогашения, СтрокаАктива.Торгуется, СтрокаАктива.СекторЭкономики, СтрокаАктива.Тикер));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
